[
    {
        "slug": "baris-kode-dan-baris-kata-sebuah-awal",
        "title": "Baris Kode dan Baris Kata: Sebuah Awal",
        "date": "2025-08-21",
        "author": "Archico Sembiring",
        "location": "Jakarta, Indonesia",
        "coverImage": "/images/blog/opening-1.png",
        "excerpt": "Sebuah pengantar tentang mengapa ada ruang untuk tulisan di tengah portofolio teknis, dan perjalanan untuk memberikan wadah bagi ide-ide yang selama ini hanya singgah sesaat.",
        "images": [
            "/images/blog/opening-2.png",
            "/images/blog/opening-3.png"
        ],
        "content": "## Mengapa Ada Blog di Sini?\n\nSelamat datang. Jika Anda sampai di halaman ini, Anda mungkin sedang menjelajahi portofolio saya sebagai seorang *software engineer*. Anda telah melihat barisan proyek, tumpukan teknologi, dan mungkin sudah mendapat gambaran tentang apa yang saya bangun dengan baris-baris kode. Lalu, mungkin muncul sebuah pertanyaan: untuk apa ada blog?\n\nJawaban singkatnya: karena sama seperti kode, cerita juga perlu dibangun. Dan ini adalah ruang yang saya bangun untuk itu.\n\n### Ide yang Tak Pernah Berlabuh\n\nSejak lama, saya memiliki ketertarikan yang mendalam pada cerita. Bukan hanya sebagai penikmat, tetapi juga sebagai penyusun. Ide-ide seringkali datang tanpa diundang, baik melalui sebuah percakapan singkat, pemandangan dari jendela, atau sebuah melodi bisa memantik kerangka narasi di dalam kepala. Namun, terlalu sering ide-ide itu hanya singgah sesaat. Mereka datang, berputar-putar, lalu pergi tanpa pernah sempat saya abadikan. Semuanya hilang begitu saja, ditelan kesibukan atau keraguan untuk menuliskannya.\n\nSaya sering terinspirasi oleh figur-figur publik, baik penulis maupun kreator, yang perjalanannya dimulai dari tulisan-tulisan sederhana. Sebuah ekspresi iseng di platform pribadi, catatan harian, atau pemikiran acak yang dibagikan, perlahan bertumbuh menjadi sesuatu yang lebih besar. Ada yang menjadi artikel terkenal, bahkan tak sedikit yang bermuara menjadi sebuah buku, lalu diadaptasi ke layar lebar. Perjalanan itu terasa begitu ajaib, namun akarnya sangatlah sederhana: **keberanian untuk memulai barisan kata pertama.**\n\n### Menghubungkan Kode dengan Cerita\n\nKeterkaitan ini terasa semakin kuat karena saya juga berkecimpung di dunia videografi dan filmografi, namun selama ini lebih banyak dari sisi teknis, seperti bagaimana sebuah kamera bekerja, bagaimana sebuah *shot* diambil, bagaimana warna diedit. Saya memahami 'bagaimana' sebuah visual diciptakan, tapi saya sadar ada 'mengapa' yang lebih dalam, yaitu cerita di baliknya.\n\nSaya berharap dengan menulis, saya dapat mendalami sisi lain dari medium yang saya cintai. Jika selama ini saya membangun 'arsitektur sistem', kini saya ingin belajar membangun 'arsitektur narasi'. Jika saya terbiasa merancang *user flow* di aplikasi, kini saya ingin merancang alur emosi dalam sebuah cerita.\n\n### Rumah Baru untuk Tulisan\n\nIni bukan pertama kalinya saya mencoba menulis. Saya pernah menuangkan cerita-cerita ekspresif di sudut-sudut internet yang sepi dalam sebuah akun Instagram pribadi yang terkunci, beberapa tulisan di Medium, dan artikel di LinkedIn yang terasa terlalu formal. Masing-masing adalah eksperimen yang berharga, namun rasanya seperti menumpang di rumah orang lain.\n\nKali ini, saya ingin berbeda. Dengan membuat blog ini di *website* yang saya bangun sendiri, saya merasa sedang membangun sebuah 'rumah' yang sesungguhnya untuk tulisan-tulisan saya. Sebuah tempat di mana saya bisa mengatur sendiri tata letaknya, warnanya, dan yang terpenting, memiliki sepenuhnya setiap kata yang tertuang.\n\nJadi, inilah awal mulanya. Sebuah ruang untuk ide-ide yang akhirnya menemukan tempat berlabuh. Entah apa yang akan tertulis di sini selanjutnya, mungkin tentang teknologi, proses kreatif, fotografi, atau sekadar observasi acak tentang kehidupan. Apapun itu, saya senang Anda ada di sini untuk menyaksikannya. Selamat membaca."
    }
]